output_samples/DFSEM/1D/Allrun
#!/bin/sh

# Create the mesh
blockMesh

# create the intial time folder
cp -r 0_org 0

# Run pimpleFoam
pimpleFoam > log
funkySetFields -time 0:
